{"text": "Вопрос: Что такое машинное обучение?\nОтвет: Машинное обучение - это раздел искусственного интеллекта, который позволяет компьютерам учиться на данных без явного программирования. Алгоритмы машинного обучения анализируют данные, находят закономерности и делают предсказания."}
{"text": "Вопрос: Какие основные типы машинного обучения существуют?\nОтвет: Существует три основных типа: 1) Обучение с учителем (supervised learning) - модель учится на размеченных данных. 2) Обучение без учителя (unsupervised learning) - модель находит закономерности в неразмеченных данных. 3) Обучение с подкреплением (reinforcement learning) - модель учится через взаимодействие со средой."}
{"text": "Вопрос: Что такое нейронная сеть?\nОтвет: Нейронная сеть - это вычислительная модель, вдохновленная структурой биологического мозга. Она состоит из искусственных нейронов, организованных в слои. Нейроны соединены между собой с весами, которые настраиваются во время обучения."}
{"text": "Вопрос: Для чего используется функция активации в нейронных сетях?\nОтвет: Функция активации добавляет нелинейность в нейронную сеть, что позволяет ей учиться сложным зависимостям в данных. Без функций активации нейронная сеть была бы просто линейным преобразованием. Популярные активации: ReLU, Sigmoid, Tanh."}
{"text": "Вопрос: Что такое переобучение (overfitting)?\nОтвет: Переобучение - это ситуация, когда модель хорошо работает на обучающих данных, но плохо на новых данных. Модель запоминает случайные шумы вместо истинных закономерностей. Способы предотвращения: регуляризация, ранняя остановка, увеличение объема данных."}
{"text": "Вопрос: Какая разница между Python и Java?\nОтвет: Python - это интерпретируемый язык с динамической типизацией, известный своей простотой и читаемостью. Java - это скомпилированный язык со статической типизацией, известный своей производительностью и масштабируемостью. Python лучше для ML и скриптов, Java лучше для enterprise приложений."}
{"text": "Вопрос: Что такое список в Python?\nОтвет: Список в Python - это упорядоченная коллекция элементов, которые могут быть разного типа. Списки создаются с квадратными скобками: [1, 2, 'hello', 3.14]. Элементы индексируются с нуля. Списки изменяемые, поэтому их можно модифицировать."}
{"text": "Вопрос: Как работает цикл for в Python?\nОтвет: Цикл for в Python перебирает элементы итерируемого объекта (список, строка, диапазон и т.д.). Синтаксис: for переменная in итерируемый_объект: блок_кода. Например: for i in range(5): print(i) выведет числа от 0 до 4."}
{"text": "Вопрос: Что такое функция в программировании?\nОтвет: Функция - это переиспользуемый блок кода, который выполняет конкретную задачу. Функции принимают входные параметры (аргументы) и возвращают результат. Преимущества функций: переиспользуемость, модульность, удобство тестирования."}
{"text": "Вопрос: Как работает git?\nОтвет: Git - это система контроля версий для отслеживания изменений в коде. Основные операции: git add (добавить файлы), git commit (сохранить изменения), git push (отправить на сервер), git pull (получить обновления). Git позволяет работать в команде и отслеживать историю проекта."}
